test/data/out/cred-note-exemption.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroLR.xsd" xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <soapenv:Body>
    <sum:RegFactuSistemaFacturacion>
      <sum:Cabecera>
        <sum1:ObligadoEmision>
          <sum1:NombreRazon>Provide One S.L.</sum1:NombreRazon>
          <sum1:NIF>B85905495</sum1:NIF>
        </sum1:ObligadoEmision>
      </sum:Cabecera>
      <sum:RegistroFactura>
        <sum1:RegistroAlta>
          <sum1:IDVersion>1.0</sum1:IDVersion>
          <sum1:IDFactura>
            <sum1:IDEmisorFactura>B85905495</sum1:IDEmisorFactura>
            <sum1:NumSerieFactura>FR-012</sum1:NumSerieFactura>
            <sum1:FechaExpedicionFactura>01-02-2022</sum1:FechaExpedicionFactura>
          </sum1:IDFactura>
          <sum1:NombreRazonEmisor>Provide One S.L.</sum1:NombreRazonEmisor>
          <sum1:TipoFactura>R1</sum1:TipoFactura>
          <sum1:TipoRectificativa>I</sum1:TipoRectificativa>
          <sum1:FacturasRectificadas>
            <sum1:IDFacturaRectificada>
              <sum1:IDEmisorFactura>B85905495</sum1:IDEmisorFactura>
              <sum1:NumSerieFactura>SAMPLE-085</sum1:NumSerieFactura>
              <sum1:FechaExpedicionFactura>10-01-2022</sum1:FechaExpedicionFactura>
            </sum1:IDFacturaRectificada>
          </sum1:FacturasRectificadas>
          <sum1:DescripcionOperacion>This is a credit note with an exemption</sum1:DescripcionOperacion>
          <sum1:Destinatarios>
            <sum1:IDDestinatario>
              <sum1:NombreRazon>Sample Customer</sum1:NombreRazon>
              <sum1:NIF>54387763P</sum1:NIF>
            </sum1:IDDestinatario>
          </sum1:Destinatarios>
          <sum1:Desglose>
            <sum1:DetalleDesglose>
              <sum1:Impuesto>01</sum1:Impuesto>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
              <sum1:TipoImpositivo>21.0</sum1:TipoImpositivo>
              <sum1:BaseImponibleOimporteNoSujeto>-1620.00</sum1:BaseImponibleOimporteNoSujeto>
              <sum1:CuotaRepercutida>-340.20</sum1:CuotaRepercutida>
            </sum1:DetalleDesglose>
            <sum1:DetalleDesglose>
              <sum1:Impuesto>01</sum1:Impuesto>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:OperacionExenta>E1</sum1:OperacionExenta>
              <sum1:BaseImponibleOimporteNoSujeto>-10.00</sum1:BaseImponibleOimporteNoSujeto>
            </sum1:DetalleDesglose>
          </sum1:Desglose>
          <sum1:CuotaTotal>-340.20</sum1:CuotaTotal>
          <sum1:ImporteTotal>-1970.20</sum1:ImporteTotal>
          <sum1:Encadenamiento>
            <sum1:RegistroAnterior>
              <sum1:IDEmisorFactura>B12345678</sum1:IDEmisorFactura>
              <sum1:NumSerieFactura>SAMPLE-001</sum1:NumSerieFactura>
              <sum1:FechaExpedicionFactura>26-11-2024</sum1:FechaExpedicionFactura>
              <sum1:Huella>0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF</sum1:Huella>
            </sum1:RegistroAnterior>
          </sum1:Encadenamiento>
          <sum1:SistemaInformatico>
            <sum1:NombreRazon>My Software</sum1:NombreRazon>
            <sum1:NIF>12345678A</sum1:NIF>
            <sum1:NombreSistemaInformatico>My Software</sum1:NombreSistemaInformatico>
            <sum1:IdSistemaInformatico>A1</sum1:IdSistemaInformatico>
            <sum1:Version>1.0</sum1:Version>
            <sum1:NumeroInstalacion>12345678A</sum1:NumeroInstalacion>
            <sum1:TipoUsoPosibleSoloVerifactu>S</sum1:TipoUsoPosibleSoloVerifactu>
            <sum1:TipoUsoPosibleMultiOT>S</sum1:TipoUsoPosibleMultiOT>
            <sum1:IndicadorMultiplesOT>N</sum1:IndicadorMultiplesOT>
          </sum1:SistemaInformatico>
          <sum1:FechaHoraHusoGenRegistro>2024-11-26T05:00:00+01:00</sum1:FechaHoraHusoGenRegistro>
          <sum1:TipoHuella>01</sum1:TipoHuella>
          <sum1:Huella>CD81AB4ECCBFC0E5EC14DFB6C351430AE9BE72C233BE9F0D402120DE93B9F129</sum1:Huella>
          <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-test-doc-id-Signature">
            <ds:SignedInfo>
              <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"></ds:CanonicalizationMethod>
              <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"></ds:SignatureMethod>
              <ds:Reference Id="Reference-test-doc-id" URI="">
                <ds:Transforms>
                  <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform>
                </ds:Transforms>
                <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod>
                <ds:DigestValue>IzBklnpQhCc8T62mNxpfYc8fZKzSz0c3lkZPrRMo93s=</ds:DigestValue>
              </ds:Reference>
              <ds:Reference Type="http://uri.etsi.org/01903#SignedProperties" URI="#Signature-test-doc-id-SignedProperties">
                <ds:Transforms>
                  <ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"></ds:Transform>
                </ds:Transforms>
                <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod>
                <ds:DigestValue>3G92E0NveZL9A2c34x0rlVE3xHJs8HnJ1SN69pM10i8=</ds:DigestValue>
              </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue Id="Signature-test-doc-id-SignatureValue">ljHbqXS/IiOxpbOeL967mAzDfTydO8rNGyFzxiGKqqnl3AdiXs8p62MsHfIaRla6r9T3HXEciS4OVo4pgMBuNZH+tqm39cJArJU4PjLkH1NZShj5wM6oF+gy5IraLkPhXrIknVX98BRg538rdCWsyV+IAu0lECCYK9rx7uda7VLIdw0Wu7aNg4X6ceZ6rCzFkIz/Rn0BD1KAMlDNZ/5BpVFMz83raYRHB5K9rC2DqNWtZrd1pnwGuQkgbq3AkRxCJxx1Oyhytdpqxcoo6m++BCHFjwNqgd+8w3V5cwny4uW4+zwb1O2XSf2QaBf/qrHlicb6zd4Mjn1PuU6lCP3ynQ==</ds:SignatureValue>
            <ds:KeyInfo Id="Certificate-test-doc-id">
              <ds:X509Data>
                <ds:X509Certificate>MIIC6TCCAdGgAwIBAgIBATANBgkqhkiG9w0BAQsFADAuMREwDwYDVQQKEwhUZXN0IE9yZzEZMBcGA1UEAxMQVGVzdCBDZXJ0aWZpY2F0ZTAeFw0yNDAxMDEwMDAwMDBaFw0zNDAxMDEwMDAwMDBaMC4xETAPBgNVBAoTCFRlc3QgT3JnMRkwFwYDVQQDExBUZXN0IENlcnRpZmljYXRlMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAs0D/mPSfSSzpiUWxvqYTLjX/IMNafVpm9/aCRiKq+Hr9MwDaXV/jkXht4gyBs4plnBnitpxKKb1JoB2GkO04hVQN46IpbnwI72MukoxpYTsC8iar1WjC40doVHAQVVpmJbAW2y38xPTNHyo+lW+386Ef+PLmhilqYGpWWU1Cpg0snmGozcPtu8tH2eeeOUjy8UNVPycqYOccAzbvclDSF2Lf3yqynRVIxQzdTpGyVw4qUgUVJi5q1tV56x2Tq2IjvIArcFqHQ7rBO9ZT1PEUKGw3bPrhVcBCFO5dFfw+qCWIIRMlWtVrmpV5OCu57/7lP9PL47FllsxxFuzUDAb0ewIDAQABoxIwEDAOBgNVHQ8BAf8EBAMCB4AwDQYJKoZIhvcNAQELBQADggEBAEnkRyRNGU/Ah6pdJ9O+hVVsqjcP3BNuoj152V6kp+yGMiOMnykIeLD9GjSXRnLy28Top2bLQfcf2jJtJB9hyJYVSvyFkw4jqi/eXAWzQhf5lTnddxaAHR8JnCsd7dp5LI65VNjyRrk3lbz4E3is+oadNIOGx0MtdvENwIN6GU9Tp7FufTHXxHuCf+6Ac/7E7RCdiltlYiYWO4laibIvgwOmimXrPHfOSmET9PfI1H49abl1eVkt75Q3kwIo4Et2iuYz3Qa4svmBt36USivnMJOW1+xGmlwVasXTScWCT2iyAWyR8GJT9afB6PoeQi96n/JMbvLmb3p2/26yzaAqbEE=</ds:X509Certificate>
              </ds:X509Data>
              <ds:KeyValue>
                <ds:RSAKeyValue>
                  <ds:Modulus>s0D/mPSfSSzpiUWxvqYTLjX/IMNafVpm9/aCRiKq+Hr9MwDaXV/jkXht4gyBs4plnBnitpxKKb1JoB2GkO04hVQN46IpbnwI72MukoxpYTsC8iar1WjC40doVHAQVVpmJbAW2y38xPTNHyo+lW+386Ef+PLmhilqYGpWWU1Cpg0snmGozcPtu8tH2eeeOUjy8UNVPycqYOccAzbvclDSF2Lf3yqynRVIxQzdTpGyVw4qUgUVJi5q1tV56x2Tq2IjvIArcFqHQ7rBO9ZT1PEUKGw3bPrhVcBCFO5dFfw+qCWIIRMlWtVrmpV5OCu57/7lP9PL47FllsxxFuzUDAb0ew==</ds:Modulus>
                  <ds:Exponent>AQAB</ds:Exponent>
                </ds:RSAKeyValue>
              </ds:KeyValue>
            </ds:KeyInfo>
            <ds:Object>
              <xades:QualifyingProperties xmlns:xades="http://uri.etsi.org/01903/v1.3.2#" Id="Signature-test-doc-id-QualifyingProperties" Target="#Signature-test-doc-id-Signature">
                <xades:SignedProperties Id="Signature-test-doc-id-SignedProperties">
                  <xades:SignedSignatureProperties>
                    <xades:SigningTime>2024-11-26T04:00:00+00:00</xades:SigningTime>
                    <xades:SigningCertificate>
                      <xades:Cert>
                        <xades:CertDigest>
                          <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod>
                          <ds:DigestValue>ewsstiGgTfzBoBGrpinBPSrSMvV+sW//gV0WIZdqLY4=</ds:DigestValue>
                        </xades:CertDigest>
                        <xades:IssuerSerial>
                          <ds:X509IssuerName>CN=Test Certificate,O=Test Org</ds:X509IssuerName>
                          <ds:X509SerialNumber>1</ds:X509SerialNumber>
                        </xades:IssuerSerial>
                      </xades:Cert>
                    </xades:SigningCertificate>
                    <xades:SignaturePolicyIdentifier>
                      <xades:SignaturePolicyId>
                        <xades:SigPolicyId>
                          <xades:Identifier>urn:oid:2.16.724.1.3.1.1.2.1.9</xades:Identifier>
                        </xades:SigPolicyId>
                        <xades:SigPolicyHash>
                          <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
                          <ds:DigestValue>G7roucf600+f03r/o0bAOQ6WAs0=</ds:DigestValue>
                        </xades:SigPolicyHash>
                        <xades:SigPolicyQualifiers>
                          <xades:SigPolicyQualifier>
                            <xades:SPURI>https://sede.administracion.gob.es/politica_de_firma_anexo_1.pdf</xades:SPURI>
                          </xades:SigPolicyQualifier>
                        </xades:SigPolicyQualifiers>
                      </xades:SignaturePolicyId>
                    </xades:SignaturePolicyIdentifier>
                  </xades:SignedSignatureProperties>
                  <xades:SignedDataObjectProperties>
                    <xades:DataObjectFormat ObjectReference="#Reference-test-doc-id">
                      <xades:ObjectIdentifier>
                        <xades:Identifier>urn:oid:1.2.840.10003.5.109.10</xades:Identifier>
                      </xades:ObjectIdentifier>
                      <xades:MimeType>text/xml</xades:MimeType>
                      <xades:Encoding>UTF-8</xades:Encoding>
                    </xades:DataObjectFormat>
                  </xades:SignedDataObjectProperties>
                </xades:SignedProperties>
              </xades:QualifyingProperties>
            </ds:Object>
          </ds:Signature>
        </sum1:RegistroAlta>
      </sum:RegistroFactura>
    </sum:RegFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>